/*
Задача 5.20. Европейското по футбол
Предстои нов тип европейското първенство по футбол. За да има повече футболни мачове и емоции и за да е по-оспорвано първенството, е решено абсолютно всяка европейска страна да играе срещу всяка друга. На вас се пада нелеката задача да подготвите таблата за срещите. Те трябва да съдържат града, в който ще е срещата (това винаги е столицата на страната домакин), име на страна домакин, място за отбелязани голове за домакина и друго за отбелязани голове на страната-гост и името ѝ. Тази таблица трябва да се попълни с имената на всички европейски страни, разбъркани в случаен ред (ползвайте за целта ORDER BY RAND() ). Подсигурете се, че всяка страна ще играе и като гост, и като домакин с всяка друга, но няма да се налага да играе със себе си. :-) 
*/
USE `geography`;

SELECT `c1`.`capital` AS `Place`, 
       `c1`.`country_name` AS `Player 1`,
       NULL AS `Host`,
       NULL AS `Guest`,
       `c2`.`country_name` AS `Player 2`
FROM `countries` AS `c1`
CROSS JOIN `countries` AS `c2`

WHERE `c1`.`continent_code` = "EU" AND
      `c2`.`continent_code` = "EU"
      
ORDER BY RAND();