/* 
Задача 5.18. Игра на континенти
За да научи своите ученици да намират континентите на глобуса, една ваша позната учителка им е измислила интересна игра: организира им виртуално междуконтинентално пътуване. За целта дава на всяко дете „билетче“, на което пише от кой континент ще излети и в кой континент ще кацне самолета му и то трябва да ги посочи на глобуса. Понеже вашата позната не разбира от програмиране, а е сигурна, че има лесен начин да се направят тези билетчета, е възложила задачата на вас. Моля, подсигурете се, че билетите ще обхванат всички възможни маршрути! Направете заявка, от която да могат да се отпечатат билетите. Сортирайте имената на континентите по азбучен ред - и по колоната FROM, от където започва „пътуването“, и по колоната ТО, указваща крайната му точка.
*/
USE `geography`;

SELECT `c1`.`continent_name` AS `FROM`,
       `c2`.`continent_name` AS `TO`
FROM `continents` AS `c1`
CROSS JOIN `continents` AS `c2`

ORDER BY `c1`.`continent_name`, `c2`.`continent_name`;