/*
Задача 3.5. Намерете имейл адреса на всеки служител
Напишете SQL заявка, която намира имейл адреса на всеки служител. (от неговото собствено и фамилно име). приемете, че имейл домейна е softuni.bg. Имейлите трябва да изглеждат като "John.Doe@softuni.bg". Резултатната колона трябва да бъде наречена "full_ email_address". Изпратете вашите заявки като Подготвите БД & изпълните заявките (Prepare DB & run queries.)
*/
SELECT concat(`first_name`,".",`last_name`,"@softuni.bg") AS 'full_email_address'
FROM `soft_uni`.`employees`